'''
Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое
слово с новой строки. Строки необходимо пронумеровать. Если в слово длинное, выводить
только первые 10 букв в слове.
'''

line = input('Напишите несколько слов через пробел: ')
words = line.split()
for i, word in enumerate(words):
    print(i, word[:10])