# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы
# сотрудника. В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

import sys

hours, earnings_per_hour, bonus = map(float, sys.argv[1:])
print('Salary - {}'.format(hours * earnings_per_hour + bonus))

# Теперь в командной строке терминала пишем:
# "python HW4_Task_1.py 162 1200 20000",
# где 162 1200 20000 - это часы, почасовая ставка и премия соответственно
# под введенной строкой в терминале получаем результат:
# Salary - 214400.0
