# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3,
# а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение
# элементов списка будет прекращено.

from itertools import count, cycle

# Задача а)
for i in count(int(input('Ввведите положительное целое число: '))):
    if i >=3 and i <= 10:
        print(i)
    else:
        break

# Задача b)

example_list = [1, 1, 1, 2, 2, 3, 4, 7, 7, 9, 11, 4, 19, 17, 12, 12]

# Способ 1 - требует ввода пользователем любого символа (или q для выхода) после
# вывода каждого элемента в списке отдельной строкой.
iterator = cycle(example_list)
stop = ''
while stop != 'q':
    print(next(iterator), end = '')
    stop = input("Press Enter to continue, type 'q' to exit.")

# Способ 2

n = int(input('Введите число элементов, которое Вам требуется: '))

for i, e in enumerate(cycle(example_list)):
    if i == n:
        break
    print(e)