# Создать (программно) текстовый файл, записать в него программно набор чисел,
# разделенных пробелами. Программа должна подсчитывать сумму чисел в файле и выводить
# ее на экран.

with open('Task_5.txt', 'w', encoding='utf-8') as f:
    nums = input('Введите целые числа через пробел: ')
    f.write('Введенные Вами числа: '+ nums + '\n')
    nums = map(int, nums.split()) # выводим из списка и разделяем
    summa = sum(nums)
    f.write('Сумма введенных Вами чисел равна: '+ str(summa))
    print('Сумма введённых Вами чисел равна: ', summa)
print('Готово, информация записана в текстовый файл Task_5.txt!')