'''
Запросите у пользователя значения выручки и издержек фирмы.
Определите, с каким финансовым результатом работает фирма
(прибыль — выручка больше издержек, или убыток — издержки больше выручки).
Выведите соответствующее сообщение. Если фирма отработала с прибылью,
вычислите рентабельность выручки (соотношение прибыли к выручке).
Далее запросите численность сотрудников фирмы и определите прибыль фирмы
в расчете на одного сотрудника.
'''

Turnover = int(input('Введите значение годовой выручки Вашей компании: '))
Costs = int(input('Введите значение годовых издержек Вашей компании: '))
Profit = Turnover - Costs

if Profit < 0:
    print(f'Ваше предприятие приносит убытки в размере {Profit} в год')
elif Profit == 0:
    print('Ваше предприятие не приносит прибыли')
else:
    Profitability = Profit / Turnover
    print(f'Ваша годовая рентабельность {Profitability * 100} процентов')
    Employees = int(input('Введите количество персонала в Вашей компании: '))
    Profit_per_employee = Profit / Employees
    print(f'Средняя прибыль на одного работника составляет {Profit_per_employee} в год')
