'''
Спортсмен занимается ежедневными пробежками.
В первый день его результат составил a километров.
Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
Требуется определить номер дня, на который результат спортсмена составит
не менее b километров.
Программа должна принимать значения параметров a и b
и  выводить одно натуральное число — номер дня.
Например: a = 2, b = 3.
Результат:
1-й день: 2
2-й день: 2,2
3-й день: 2,42
4-й день: 2,66
5-й день: 2,93
6-й день: 3,22
Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.
'''

Current_Distance = float(input('Сколько км Вы пробегаете сейчас?: '))
Future_Distance = float(input('Сколько км Вы хотели бы пробежать в будущем?: '))
i = 1

while Current_Distance <= Future_Distance:
    print(f'{i}й день - {Current_Distance} км')
    Current_Distance = Current_Distance * 1.1
    i += 1


print(f'Вы достигнете желаемого результата в {Future_Distance}км на {i}й день')

