'''
Программа запрашивает у пользователя строку чисел, разделенных пробелом.
При нажатии Enter должна выводиться сумма чисел.
Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
Но если вместо числа вводится специальный символ, выполнение программы завершается.
Если специальный символ введен после нескольких чисел, то вначале нужно добавить
сумму этих чисел к полученной ранее сумме и после этого завершить программу.
'''

def summation():
    exit_var = False
    result = 0
    while exit_var == False:
        numbers = input('Введите числа через пробел, или q для выхода: ').split()
        interim_res = 0
        for number in numbers:
            if 'q' in number:
                exit_var = True
                break
            interim_res += float(number)
        result += interim_res
    return result

print(summation())
