'''
Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
имя, фамилия, год рождения, город проживания, email, телефон.
Функция должна принимать параметры как именованные аргументы.
Реализовать вывод данных о пользователе одной строкой.
'''

def personal_info(**kwargs):
    return kwargs

print(personal_info(
    surname=input('Введите Фамилию: '),
    name=input('Введите Имя: '),
    birthday=input('Введите Дату Рождения: '),
    city=input('Введите город проживания: '),
    email=input('Введите адрес электронной почты: '),
    phone=input('Введите номер телефона: ')
))
